use strict;
use warnings;
use utf8;

#######################################################
# 指定文字列にマッチした行を抽出
#    第１引数:  対象ファイル
#    第２引数:  キーワード
#    標準出力： 出力ファイルに結果をリダイレクト
########################################################

my ($file, $match) = @ARGV;
$\ = "\n";

print_match_line($file, $match);

sub print_match_line {
    my ($file, $match) = @_;

    # ユーザ情報ファイルを読み込み
    open my $fh, '<', $file
	or die qq{Can't open file "$file" : $!};

    while (my $row = <$fh>) {
	next if $row =~ /^\n/;
	next if $row =~ /^--/;
	next if $row =~ /02000|02100|02200|02300|10070|08101|08102|08103|08112|08121|08131|08141|08161|08201|08202|08203|08204|08205|08302|08303|10007|10003|10009|10010|10011|10012|10013|10014|10025|10026|10027|10041|10041|10042|10043|10044|10045|10046|10058|10059|10060|10061|10063|10064|10066|10067|10068/;
#	next if $row =~ /102199|102299|102251|102111|102221|102125|102132|102141|102142|102132|102134|102135|102136|102112|102211|102131|102242|102199|102299/;
	
    #   next if $. == 1;

	chomp($row);

	if ($row =~ /\<$match/) {
	    my $row_num = sprintf("%05d",$.);
	    print $row_num . $row;
	}
    }
    close $fh;
}
